# This Brewfile was generated using `brew bundle dump --describe --no-vscode .`
# It lists Homebrew taps, formulae, and casks.
# To install all listed items, run `brew bundle` in this directory.
# To update this file after adding/removing brew packages, run `brew bundle dump --describe --no-vscode .` again.

tap "dotenvx/brew"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mongodb/brew"
# Official Amazon AWS command-line interface
brew "awscli"
# Toolchain of the web
brew "biome"
# GitHub command-line tool
brew "gh"
# Platform built on V8 to build network applications
brew "node", link: false
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Node version management
brew "n"
# Fast, disk space efficient package manager
brew "pnpm"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# ASGI web server
brew "uvicorn"
# Secure dotenv–from the creator of `dotenv`
brew "dotenvx/brew/dotenvx"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Web browser focusing on privacy
cask "brave-browser"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
cask "font-cascadia-code-pl"
cask "font-code-new-roman-nerd-font"
cask "font-fira-code"
cask "font-google-sans-code"
cask "font-iosevka"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Discover, download, and run local LLMs
cask "lm-studio"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# GUI for streamlined Redis application development
cask "redis-insight"
# Team communication and collaboration software
cask "slack"
# SSH client
cask "termius"
# Open-source code editor
cask "visual-studio-code"
# Open-source code editor
cask "visual-studio-code@insiders"
# Video communication and virtual meeting platform
cask "zoom"
# Browser focusing on privacy and security
cask "zen"
