tap "dotenvx/brew"
tap "homebrew/services"
tap "mongodb/brew"
# Official Amazon AWS command-line interface
brew "awscli"
# Toolchain of the web
brew "biome"
# GitHub command-line tool
brew "gh"
# Platform built on V8 to build network applications
brew "node", link: false
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Fast, disk space efficient package manager
brew "pnpm"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Better dotenv–from the creator of `dotenv`
brew "dotenvx/brew/dotenvx"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Web browser focusing on privacy
cask "brave-browser"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Collaborative team software
cask "figma"
cask "font-cascadia-code-pl"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
# Open-source code editor
cask "visual-studio-code@insiders"
# Video communication and virtual meeting platform
cask "zoom"
# Browser focusing on privacy and security
cask "zen"
